soap/REQUEST/country/get-country.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <auth:Authorization xmlns:auth="http://duckacademy.nl/springsoap/">ValidAuthToken</auth:Authorization>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns2:getCountryRequest xmlns:ns2="http://duckacademy.nl/springsoap/gen">
            <ns2:name>Spain</ns2:name>
        </ns2:getCountryRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>




<?xml version = "1.0"?>
<data xmlns:duck="http://duckacademy.nl/user"
      xmlns:google="http://google.es/user">
    <users>
        <duck:user>
            <name>Pepe</name>
        </duck:user>
        <google:user>
            <fullName>Pepe Perez</fullName>
        </google:user>
    </users>
</data>